# EndTreatment Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EndTreatment Property
ParameterTypeId Class See Also
---
"End Treatment"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EndTreatment { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EndTreatment As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EndTreatment {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace